{
    "history": {
        "privacy": "A",
        "privacyDetails": "Reddit generally has a good reputation with privacy since they don't collect a lot of data",
        "security": "C",
        "securityDetails": "Reddit has had quite a few data leaks over its history including a leak of early Reddit user data from 2005-2007, as well as an exploitation of 2 factor authentication.",
        "value": 0.85
    },
    "userbase": {
        "amount": 9,
        "amountDetails": "1.6 Billion users."
    },
    "anonymous": {
        "value": true,
        "details": "Reddit Users are only seen by username (not even email), and most reditters use usernames that have no relation to their name."
    },
    "tracking": {
        "cookies": false,
        "cookiesDetails": "Reddit gives users the option to disable tracker cookies on the browser but that option isn't available in the app",
        "SSO": true,
        "SSODetails": "There are multiple apps on the appstore that uses Reddit Oauth to sign into Reddit. Depending on the app, Reddit may be getting tracking data."
    },
    "ownership": {
        "personalData":true,
        "personalDataDetails": "Reddit makes it easy to delete your posts and because Reddit only collects email address, they don't have much ownership of anything.",
        "delete": true,
        "deleteDifficulty": 1,
        "deleteDetails": "Deleting a Reddit account is as easy as entering in your password." 
    },
    "notification": {
        "notify": true,
        "notifyDetails": "Reddit typically notifies its users of privacy policy changes in the Announcements Subreddit, and moderaters are always available to answer questions regarding policy."
    },
    "summary": {
        "grade": "B",
        "details": "Reddit respects user privacy and takes it very seriously. That being said, Reddit does fall short on Data Security, but due to the lack of data that Reddit collects, it is not a huge issue. This is a great social media for those that take their privacy seriously."
    }
}